## 1.

In [ ]:
## 1. read.csv
## 2. head
## 3. tail
## 4. describe
## 5.loc and iloc

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("titanic.csv")

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
df.loc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                    35.0
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

In [14]:
df[['PassengerId']]

     PassengerId
0              1
1              2
2              3
3              4
4              5
..           ...
886          887
887          888
888          889
889          890
890          891

[891 rows x 1 columns]

## 2.

In [15]:
import pandas as pd

In [18]:
A={'A':[1,2,3],
   'b':[4,5,6],
   'c':[7,8,9]}

In [19]:
df=pd.DataFrame(A)

In [20]:
df

   A  b  c
0  1  4  7
1  2  5  8
2  3  6  9

## 3.

In [105]:
a={'Values':[10,20,30,40,50]}

In [106]:
fd=pd.DataFrame(a)

In [107]:
fd

   Values
0      10
1      20
2      30
3      40
4      50

In [108]:
x=fd.loc[0:2].sum()

In [109]:
x

Values    60
dtype: int64

## 4.

In [3]:
import pandas as pd

In [4]:
A={"Text":["My name is mohammed khateeb"]}
df=pd.DataFrame(A)

In [5]:
df

                          Text
0  My name is mohammed khateeb

In [12]:
df['Word_Count']=df['Text'].apply(len)

In [13]:
df

                          Text  Word_Count
0  My name is mohammed khateeb          27

## 5.

In [20]:
import pandas as pd

In [23]:
df=pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")

In [24]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
## The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. 
## Otherwise, return the number of rows times the number of columns if DataFrame.

In [26]:
df.size

4122

In [ ]:
## The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

In [27]:
df.shape

(458, 9)

In [ ]:
## The ndim property is used to get an int representing the number of axes/array dimensions and Return 1 if Series.
## Otherwise, return 2 if DataFrame.

In [28]:
df.ndim

2

## 6.

In [ ]:
pandas.read_excel

## 7.

In [6]:
import pandas as pd

In [7]:
A={"Email":["username@domain.com"]}

In [13]:
dr=pd.DataFrame(A)

In [14]:
dr

                 Email
0  username@domain.com

In [25]:
for i in dr['Email'].groupby(lambda x:x=="@"):
          print (i)

(False, 0    username@domain.com
Name: Email, dtype: object)

In [ ]:
df['user_name']=df['Email'].groupby

## 8

In [37]:
import pandas as pd

In [101]:
g={"A":[3,8,6,2,9],
  "B":[5,2,9,3,1],
  "C":[1,7,4,5,2]}

In [102]:
dt=pd.DataFrame(g)

In [103]:
dt

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [157]:
for i in dt['A']>5,dt['B']<10,dt['C']:
    print (i)

0    False
1     True
2     True
3    False
4     True
Name: A, dtype: bool
0    True
1    True
2    True
3    True
4    True
Name: B, dtype: bool
0    1
1    7
2    4
3    5
4    2
Name: C, dtype: int64

## 9.

In [158]:
A={'A':[1,2,3,4]}

In [160]:
DF=pd.DataFrame(A)

In [162]:
DF.mean()

A    2.5
dtype: float64

In [163]:
DF.median()

A    2.5
dtype: float64

In [164]:
DF.std()

A    1.290994
dtype: float64

## 10.

In [169]:
A={"sales":[10,20,30],
  "Date":["2022-2-5","2022-3-20","2022-4-20"]}

In [171]:
ty=pd.DataFrame(A)

In [172]:
ty

   sales       Date
0     10   2022-2-5
1     20  2022-3-20
2     30  2022-4-20

In [173]:
ty["Moving average"]=ty['sales'].mean()

In [174]:
ty

   sales       Date  Moving average
0     10   2022-2-5            20.0
1     20  2022-3-20            20.0
2     30  2022-4-20            20.0

## 11.

In [6]:
A=pd.date_range(start='2023-1-1',end='2023-1-5')

In [7]:
A

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df=pd.DataFrame({"date":A},index=[1,2,3,4,5])

In [11]:
df

        date
1 2023-01-01
2 2023-01-02
3 2023-01-03
4 2023-01-04
5 2023-01-05

In [15]:
df["day"]=df["date"].dt.day_name()

In [16]:
df

        date        day
1 2023-01-01     Sunday
2 2023-01-02     Monday
3 2023-01-03    Tuesday
4 2023-01-04  Wednesday
5 2023-01-05   Thursday

## 13.

In [ ]:
numpy library and pandas library itself.